## Homework

In [1]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/esunpy/master/data/Churn_Modelling.csv')

In [2]:
df.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [3]:
! wget https://raw.githubusercontent.com/ywchiu/esunpy/master/data/Churn_Modelling.csv

--2020-09-27 01:41:48--  https://raw.githubusercontent.com/ywchiu/esunpy/master/data/Churn_Modelling.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 674857 (659K) [text/plain]
Saving to: ‘Churn_Modelling.csv’

Churn_Modelling.csv 100%[===================>] 659.04K  --.-KB/s    in 0.06s

2020-09-27 01:41:48 (10.4 MB/s) - ‘Churn_Modelling.csv’ saved [674857/674857]

In [5]:
df = pandas.read_csv('Churn_Modelling.csv')

In [6]:
df.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [7]:
## select gender, avg(estimatedsalary) from df group by gender
df.groupby('Gender')['EstimatedSalary'].mean()

Gender
Female    100601.541382
Male       99664.576931
Name: EstimatedSalary, dtype: float64

In [8]:
df.groupby(['Geography','Gender'])['EstimatedSalary'].mean()

Geography  Gender
France     Female     99564.252755
           Male      100174.252495
Germany    Female    102446.424124
           Male       99905.033959
Spain      Female    100734.107475
           Male       98425.687680
Name: EstimatedSalary, dtype: float64

## Panndas IO

In [9]:
# csv: Comma-Separated Values 逗號分隔值
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample.csv')

In [10]:
df.head()

   Unnamed: 0       id          address  ...  area    price browsenum_all
0           0  6032971  永康街47巷永康街五樓頂加..  ...  46.8   60,000           751
1           1  6054083   仁愛路四段仁愛路樹海景觀..  ...  76.9  100,000           162
2           2  5957980   光復南路高樓層大巨蛋正對..  ...  71.3  150,000          2385
3           3  6043839     永康街23巷永康商圈..  ...  18.0   29,000          1323
4           4  5181793      雲和街師大*已收訂..  ...  28.0   31,800          2303

[5 rows x 9 columns]

In [17]:
# tab
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/purchase_order.tab', 
            sep='\t', header=None, names = ['dt', 'action', 'uid', 'pid', 'quantity', 'price'])

In [18]:
df.head()

                    dt action           uid             pid  quantity   price
0  2015-07-01 00:00:01  order    U312622727     P0006944501         1  1069.0
1  2015-07-01 00:00:03  order    U239012343     P0006018073         1  1680.0
2  2015-07-01 00:00:19  order  U10007697373     P0002267974         1   285.0
3  2015-07-01 00:01:10  order    U296328517     P0016144236         1   550.0
4  2015-07-01 00:01:36  order    U300884570  P0014516980122         1   249.0

In [20]:
#df = pandas.read_clipboard()

In [22]:
df.to_csv('test.csv')

In [23]:
df.to_excel('test.xlsx')

In [26]:
df.head().to_json()

'{"dt":{"0":"2015-07-01 00:00:01","1":"2015-07-01 00:00:03","2":"2015-07-01 00:00:19","3":"2015-07-01 00:01:10","4":"2015-07-01 00:01:36"},"action":{"0":"order","1":"order","2":"order","3":"order","4":"order"},"uid":{"0":"U312622727","1":"U239012343","2":"U10007697373","3":"U296328517","4":"U300884570"},"pid":{"0":"P0006944501","1":"P0006018073","2":"P0002267974","3":"P0016144236","4":"P0014516980122"},"quantity":{"0":1,"1":1,"2":1,"3":1,"4":1},"price":{"0":1069.0,"1":1680.0,"2":285.0,"3":550.0,"4":249.0}}'

In [34]:
import json
json.loads(df.head().T.to_json()).values()

dict_values([{'dt': '2015-07-01 00:00:01', 'action': 'order', 'uid': 'U312622727', 'pid': 'P0006944501', 'quantity': 1, 'price': 1069.0}, {'dt': '2015-07-01 00:00:03', 'action': 'order', 'uid': 'U239012343', 'pid': 'P0006018073', 'quantity': 1, 'price': 1680.0}, {'dt': '2015-07-01 00:00:19', 'action': 'order', 'uid': 'U10007697373', 'pid': 'P0002267974', 'quantity': 1, 'price': 285.0}, {'dt': '2015-07-01 00:01:10', 'action': 'order', 'uid': 'U296328517', 'pid': 'P0016144236', 'quantity': 1, 'price': 550.0}, {'dt': '2015-07-01 00:01:36', 'action': 'order', 'uid': 'U300884570', 'pid': 'P0014516980122', 'quantity': 1, 'price': 249.0}])

In [37]:
df.head().T.to_dict()

{0: {'action': 'order',
  'dt': '2015-07-01 00:00:01',
  'pid': 'P0006944501',
  'price': 1069.0,
  'quantity': 1,
  'uid': 'U312622727'},
 1: {'action': 'order',
  'dt': '2015-07-01 00:00:03',
  'pid': 'P0006018073',
  'price': 1680.0,
  'quantity': 1,
  'uid': 'U239012343'},
 2: {'action': 'order',
  'dt': '2015-07-01 00:00:19',
  'pid': 'P0002267974',
  'price': 285.0,
  'quantity': 1,
  'uid': 'U10007697373'},
 3: {'action': 'order',
  'dt': '2015-07-01 00:01:10',
  'pid': 'P0016144236',
  'price': 550.0,
  'quantity': 1,
  'uid': 'U296328517'},
 4: {'action': 'order',
  'dt': '2015-07-01 00:01:36',
  'pid': 'P0014516980122',
  'price': 249.0,
  'quantity': 1,
  'uid': 'U300884570'}}

HTML TABLE

<table>
  <thead>
    <tr><th>c1</th> <th>c2</th></tr>
  </thead>
  <tbody>
    <tr><td>v1</td> <td>v2</td></tr>
    <tr><td>v3</td> <td>v4</td></tr>
  </tbody>
</table>

In [39]:
from bs4 import BeautifulSoup
table = '''
<table>
  <thead>
    <tr><th>c1</th> <th>c2</th></tr>
  </thead>
  <tbody>
    <tr><td>v1</td> <td>v2</td></tr>
    <tr><td>v3</td> <td>v4</td></tr>
  </tbody>
</table>
'''
soup = BeautifulSoup(table, 'lxml')
for tr in soup.select('tr'):
  print(tr.select('td'))

[]
[<td>v1</td>, <td>v2</td>]
[<td>v3</td>, <td>v4</td>]

In [45]:
dfs = pandas.read_html(table)
type(dfs)
len(dfs)
dfs[0]

   c1  c2
0  v1  v2
1  v3  v4

In [47]:
import pandas
dfs = pandas.read_html('https://money.udn.com/money/breaknews/1001')

In [49]:
#dfs[0]

### Practice
- 請將台銀的匯率資訊 (https://rate.bot.com.tw/xrt/quote/l6m/USD) 讀成 pandas DataFrame